
export const Kin = `#Кинематика

![kinematika](https://uchitel.pro/wp-content/uploads/2017/09/2018-02-23_21-25-22-1024x489.jpg)

**Механическое движение** – изменение положения тела относительно других тел с течением времени. Способы описания: словесный, табличный, графический, формулами.

**Mатериальная точка** – тело, собственными размерами которого в данных условиях можно пренебречь.

![kinematika](https://uchitel.pro/wp-content/uploads/2017/09/2018-02-23_21-25-53-1024x351.jpg)

**Траектория** – линия, которую описывает материальная точка при своём движении в пространстве. По виду траектории все движения делятся на прямолинейные и криволинейные.

**Система отсчёта** – часы и система координат, связанные с условно выбираемым телом отсчёта (наблюдателем).

![kinematika](https://uchitel.pro/wp-content/uploads/2017/09/2018-02-23_21-26-21-1024x356.jpg)

**Относительность** движения – различие скорости, направления и траектории движения в различных системах отсчёта.

**Перемещение** – вектор, проведённый из начального положения материальной точки в её конечное положение.

![kinematika](https://uchitel.pro/wp-content/uploads/2017/09/2018-02-23_21-26-39-1024x318.jpg)

#Типы движений

##1. Равномерное движение

###1.1. Равномерное прямолинейное движение

**Равномерное движение** – движение тела, при котором за равные интервалы времени оно преодолевает равные части пути.

**Скорость равномерного движения** равна отношению пройденного пути к интервалу времени, за который этот путь пройден.

**Скорость равномерного прямолинейного движения** равна отношению перемещения к интервалу времени его совершения.

**Мгновенная скорость** равна отношению перемещения к бесконечно малому интервалу времени, за который оно произошло.

###1.2 Равномерное движение по окружности (равномерное вращение)

**Равномерное движение по окружности** — это движение, при котором материальная точка за равные промежутки времени проходит равные по длине дуги окружности.

**Равномерное движение тела по окружности** — это частный и наиболее простой случай криволинейного движения. Хотя при таком движении модуль скорости остается постоянным, это движение с ускорением, которое является следствием изменения направления вектора скорости. 

##2. Движение с постоянным ускорением

**Равноускоренное движение** – движение, при котором мгновенная скорость за любые равные интервалы времени меняется одинаково.

**Мгновенное ускорение равно** отношению изменения мгновенной скорости тела к бесконечно малому интервалу времени, за который это изменение произошло.

**Ускорение равноускоренного движения** равно отношению изменения мгновенной скорости тела к интервалу времени, за который это изменение произошло.

**Центростремительное ускорение** – ускорение, всегда направленное к центру окружности при равномерном движении по ней материальной точки. Модуль центростремительного ускорения равен отношению квадрата модуля скорости равномерного движения по окружности к её радиусу.
`
export const Din = `
#Динамика

![dinamika](https://uchitel.pro/wp-content/uploads/2017/09/2.-Динамика_1-1024x751.jpg)

**Первый закон Ньютона** утверждает, что существуют инерциальные системы отсчёта, относительно которых тела сохраняют скорость постоянной, если на них не действуют другие тела.

**Второй закон Ньютона** утверждает, что ускорение, приобретаемое телом под действием силы, прямо пропорционально модулю силы и обратно пропорционально массе тела.

**Третий закон Ньютона** утверждает, что взаимодействующие тела действуют друг на друга с силами, векторы которых равны по модулю и противоположны по направлению.

![dinamika](https://uchitel.pro/wp-content/uploads/2017/09/2.-Динамика_2-1024x738.jpg)


**Закон всемирного тяготения** гласит: сила гравитационного притяжения двух материальных точек прямо пропорциональна произведению их масс и обратно пропорциональна квадрату расстояния между ними. Коэффициентом пропорциональности служит гравитационная постоянная.

**Закон Гука** устанавливает пропорциональность модуля силы упругости модулю удлинения тела, если его деформация является упругой. Коэффициентом пропорциональности служит коэффициент жёсткости тела.


![dinamika](https://uchitel.pro/wp-content/uploads/2017/09/2.-Динамика_3-1024x595.jpg)

 

**Закон Амонтона-Кулона** устанавливает пропорциональность силы трения скольжения или максимальной силы трения покоя силе нормальной реакции опоры. Коэффициентом пропорциональности служит коэффициент трения.

**Импульсом силы** называют произведение вектора скорости на интервал времени её действия. Единица модуля импульса силы – 1 кг·м/c.

**Импульсом тела** (количеством движения) называют произведение массы тела на вектор его скорости. Единица модуля импульса тела – 1 кг·м/c.

![dinamika](https://uchitel.pro/wp-content/uploads/2017/09/2.-Динамика_4-1024x869.jpg)


**Закон сохранения импульса** гласит: сумма импульсов тел до их взаимодействия равна сумме импульсов этих же тел после взаимодействия, если система замкнута.

**Изменение кинетической энергии** тела равно работе равнодействующей всех сил. Кинетическая энергия тела, перемещающегося в пространстве без вращения, равна половине произведения его массы на квадрат скорости. Единица для измерения – 1 Дж.

**Изменение потенциальной энергии** тела равно взятой с противоположным знаком работе рассматриваемой потенциальной силы. Потенциальная энергия при действии силы тяжести равна произведению модуля силы тяжести на расстояние от тела до выбранного нулевого уровня энергии. Потенциальная энергия при действии силы упругости равна половине произведения коэффициента жёсткости на квадрат удлинения тела по сравнению с его недеформированным состоянием. Единица для измерения потенциальной энергии любого вида – 1 Дж.

`
export const Stat = `

Условия равновесия  тела:

а) Поступательно движущееся тело находится в состоянии равновесия (покоится или движется прямолинейно и равномерно),    если  

б) Вращающееся    тело,   имеющее   неподвижную ось вращения, находится в покое или равномерно вращается, если         М1 + М2 + М3 + … + MN = 0,  где М — момент силы —  произведение силы на её плечо.

Статика и гидростатика

Виды равновесия.
Виды равновесия тела с закрепленной осью вращения:
а) если ось проходит через центр масс, то тело находится в безразличном равновесии при любом положении тела (а);

б) ось выше точки центра тяжести — устойчивое равновесие (б);

в) ось ниже точки центра тяжести — неустойчивое равновесие( в).

Виды равновесия тела, имеющего точку опоры:
а) если равнодействующая всех сил направлена к положению равновесия, то тело находится в устойчивом положении (рис. а);

б)    если равнодействующая всех сил направлена от положения равновесия, то тело находится в неустойчивом  равновесии (рис. б);

в)    если Σ  = 0, — равновесие безразличное (рис. в).

Виды равновесия тела, имеющего площадь опоры.
Если вертикаль, проведенная через центр тяжести тела, пересекает площадь его опоры, то равновесие тела устойчивое. Если не пересекает, то тело падает, — равновесие неустойчивое.

Простые механизмы и блоки
Простые механизмы — приспособления, которые служат для преобразования силы. К ним относятся:  рычаг (блок, ворот) и наклонная плоскость (клин, винт). Они применяются для получения выигрыша в силе.

F2/F1 – выигрыш в силе.      F1l1=F2l2 — условие равновесия рычага для двух сил.

Золотое правило механики: все простые механизмы, не дают выигрыша в работе — во сколько раз мы выигрываем в силе, во столько же раз мы проигрываем в расстоянии.

Блоки

 

Гидростатика.
Давление — скалярная физическая величина, равная отношению модуля силы, действующей перпендикулярно поверхности, к площади её поверхности.   

Гидростатическое давление — давление, обусловленное весом столба жидкости. Манометр — прибор для измерения давления в жидкости или газа. 

p = ρжgh   — давление на произвольной глубине несжимаемой жидкости            

F = pS = ρжghSдна  — сила давления на дно сосуда         

Гидростатика

 На одном и том же уровне давление одинаково во всех направлениях.

Давление р на произвольной глубине h сжимаемой поршнем жидкости определяется давлением поршня и давлением столба жидкости           р = рпорш. + ρжgh



 Атмосферное давление – давление, которое производит воздушная оболочка Земли.

Опыт Торричелли (1634 г.) свидетельствует: атмосферное  давление  равно давлению столба ртути в трубке.

Нормальное атмосферное давление:  1 атм = 760 мм.рт.ст. = 1 01325 Па ≈ 105 Па (при 0ºС);     1 мм.рт.ст.=133,3 Па

Оно может изменяться от места к месту и во времени (циклоны и антициклоны) и убывает с увеличением высоты над уровнем моря (на каждые 12 м подъёма  оно уменьшается на 1 мм. рт. ст.).

Барометры — приборы для измерения атмосферного давления. Существуют 1) жидкостный;  2) барометр — анероид (металлический).

Закон Паскаля (1653 г.) —  жидкости и газы передают производимое на них давление во все стороны одинаково. 

 Сообщающимися называются сосуды, соединённые между собой каналом с жидкостью.

гидравлический пресс

Закон Архимеда: на тело, погруженное в покоящуюся жидкость (или газ), действует выталкивающая сила, направленная  вертикально верх и равная весу жидкости, вытесненной телом.

FA =ρжgVпчт                        FA = Рж,выт.= mж,выт g,

FA = Рвоз — Ржид.    Vпчт – объём погруженной части тела.    ρж — плотность жидкости или газа.

Условие плавания тел:

а) FA > mg, ρт > ρж — тело всплывает;  

б) FA < mg, ρт < ρж — тело тонет;      

в) FA = mg, ρт = ρж — тело находится в равновесии на любой глубине.  

Условие плавания тела на поверхности  FA = mg

Если тело будет плавать частично погрузившись в жидкость, то ρж/ρт=Vт/Vпчт

На этом основано применение ареометра- прибора для определения плотности жидкости.
`
export const Zse = `
Законы сохранения

Импульсом тела (материальной точки) называют произведение массы тела на вектор его скорости. Единица модуля импульса тела – 1 кг·м/c.

Импульсом силы называют произведение вектора скорости на интервал времени её действия ∆t. Единица модуля импульса силы – 1 кг·м/c.

                  [F·∆t] = Н·м.


Ударом (или столкновением) принято называть кратковременное взаимодействие тел, в результате которого их скорости испытывают значительные изменения.

Абсолютно упругим ударом  называется столкновение, при котором сохраняется механическая энергия  системы тел.

Абсолютно неупругим ударом называют такое ударное взаимодействие, при котором тела соединяются  друг с другом  и              движутся дальше как одно тело.  Механическая энергия не сохраняется (она частично или полностью переходит во внутреннюю энергию тел).

Закон сохранения импульса.
Замкнутая (изолированная) система – система тел, взаимодействующих только между собой и не взаимодействующих с телами, не входящими в эту систему.

Закон сохранения импульса: векторная сумма импульсов тел, составляющих  замкнутую систему, не изменяется.

Энергия – скалярная физическая величина, являющаяся мерой способности тела (или системы тел) совершить работу. Существует кинетическая и потенциальная энергия.

Закон сохранения энергии в механических процессах – сумма кинетической и потенциальной энергии тел, составляющих замкнутую систему и взаимодействующих между собой силами тяготения и силами упругости, остается неизменной.

Е = Еk1 + Ep1 = Еk2 + Ep2 = const              при Fтр = 0

Если Fтр≠ 0, механическая энергия переходит во внутреннюю (тепловую)  энергию тела:

Q = Е2 – Е1,  где Q =Атр

механическая энергия

 

Понятие потенциальной энергии можно ввести только для сил, работа которых не зависит от траектории движения тела и определяется только начальным и конечным положениями. Такие силы называются консервативными (силы тяжести и силы упругости)

 Работа силы.
Механической  работой A, совершаемой постоянной силой, называется скалярная физическая величина, равная произведению модулей силы и перемещения, умноженному на косинус угла α между векторами силы и перемещения.        

                  А = F∙s∙cos α                     [А] = Дж                                1Дж =1Н∙1м

 Работа зависит от угла α.

работа силы, мощность

Работа силы  тяжести не зависит от формы траектории и равна изменению потенциальной энергии тела, взятому с противоположным знаком.
Атяж. = mg(h1 – h2) =  — ( mgh1 — mgh2) = — (Ер2 – Ер1)

Работа силы  тяжести по замкнутой траектории равна нулю.

Мощность – скалярная физическая величина, равная отношению совершенной работы к промежутку времени, за который она совершена.

Коэффициент полезного действия механизмов КПД – величина, равная отношению полезной работы к полной работ, выраженная в процентах.
`
export const Kol = ``
export const Mol = `
1. Молекулярно-кинетическая теория (МКТ) – раздел физики, учение, объясняющее свойства тел и происходящие с ними явления с точки зрения микроскопического строения этих тел.

2. Все вещества состоят из отдельных частиц (молекул, ионов и атомов), между которыми есть промежутки. Эти частицы не изменяются при изменении температуры или агрегатного состояния.

3. Частицы веществ постоянно и беспорядочно движутся. Средняя скорость движения частиц тем больше, чем выше температура тела. Соответственно частицы обладают кинетической энергией.

4. Частицы вещества взаимодействуют друг с другом: притягиваются и отталкиваются. Силы притяжения-отталкивания зависят от расстояния между частицами. Соответственно, частицы обладают потенциальной энергией.

5. Внутренняя энергия тела – сумма кинетических энергий движения и потенциальных энергий взаимодействия всех частиц тела между собой: молекул, атомов, ионов и других.

6. Кристаллическое тело – твёрдое тело, имеющее постоянную температуру плавления при постоянных внешних условиях. Большинство кристаллов являются поликристаллами. В расположении частиц монокристаллов существует дальний порядок.

7. Аморфное тело – твёрдое тело со слабо выраженной текучестью, плавно усиливающейся при нагревании. В расположении частиц аморфного тела обнаруживается лишь ближний порядок.

8. Жидкость – состояние вещества, при котором тело способно изменять форму под влиянием даже малых сил. Для изменения объёма вещества требуются большие силы. Расположение и движение частиц жидкости аналогичны наблюдаемым в аморфных телах.

9. Газ – состояние вещества, при котором тело способно изменять форму и объём под влиянием очень малых сил. При давлениях, близких к атмосферному, расстояния между частицами газа значительно больше их собственных размеров. Частицы газа постоянно и хаотично летают во всём доступном им пространстве; удары частиц о препятствия создают давление газа.

10. Насыщенным паром называют пар, находящийся в термодинамическом равновесии со своей жидкостью. Давление насыщенного пара не зависит ни от каких величин, кроме температуры жидкости и пара над её поверхностью.

11. Относительная влажность воздуха – физическая величина, равная отношению плотности водяного пара, содержащегося в воздухе, к плотности насыщенного водяного пара при той же температуре. Относительную влажность воздуха выражают в процентах и измеряют гигрометрами и психрометрами.
`
export const Term = `
ТЕРМОДИНАМИКА
Термодинамика – раздел физики, изучающий тела, находящиеся в состоянии термодинамического равновесия и явления, сопровождающие переходы между этими состояниями.

Термодинамическое равновесие – состояние тел (или частей тела), при котором остаются постоянными все величины, характеризующие эти тела (или части тела): объёмы, давления, расположение масс и др.

Температура – единственная физическая величина, всегда одинаковая у всех тел (или частей тела), находящихся в состоянии термодинамического равновесия.

Термометр – прибор для измерения температуры. Единица температуры – 1 кельвин (1 К). Также используется 1 °С, равный 1 К.

Теплообмен – переход внутренней энергии одного тела во внутреннюю энергию другого тела без совершения механической работы.

Количество теплоты – физическая величина, показывающая энергию, полученную (отданную) телом при теплообмене.

Калориметр – прибор для измерения количества теплоты. Единица количества теплоты – 1 джоуль (1 Дж).

Удельная теплоемкость вещества – физическая величина, показывающая количество теплоты, необходимое для изменения температуры 1 кг этого вещества на 1 °С. Единица удельной теплоёмкости – 1 Дж/(кг·°С).

Количество теплоты, полученное (отданное) телом при теплообмене, пропорционально массе тела и изменению его температуры. Коэффициент пропорциональности – удельная теплоёмкость вещества.

Превращение твёрдого тела в жидкость называют плавлением.Обратное явление называют отвердеванием. Если при этом получается кристаллическое тело, то отвердевание называют кристаллизацией.

Температура
Температурой плавления называют температуру, при которой нагреваемое кристаллическое тело тело начинает плавиться, и при этом одновременно существуют твёрдое и жидкое состояния его вещества.

Температурой кристаллизации называют температуру, при которой охлаждаемая жидкость начинает кристаллизоваться, и при этом одновременно существуют её твёрдое и жидкое состояния.

Как правило, температура кристаллизации вещества равна температуре его плавления. Температура плавления/кристаллизации вещества зависит от внешнего давления и других факторов.

Удельная теплота плавления – физическая величина, показывающая количество теплоты, необходимое для плавления или выделяющееся при кристаллизации 1 кг вещества, находящегося при температуре плавления/кристаллизации. Единица удельной теплоты плавления – 1 Дж/кг.

Количество теплоты, поглощаемое (выделяющееся) при плавлении (кристаллизации), пропорционально массе расплавившегося (кристаллизовавшегося) вещества. Коэффициент пропорциональности – удельная теплота плавления вещества.

Видами парообразования являются: испарение – парообразование, происходящее с поверхности жидкости; кипение – парообразование, происходящее по всему объёму жидкости вследствие возникновения и всплытия на поверхность пузырей пара; сублимация – парообразование, происходящее с поверхности твёрдого тела.

Температурой кипения называют температуру, при которой наблюдается кипение вещества (интенсивное парообразование по всему объёму этого вещества). Температура кипения зависит от внешнего давления и других факторов.

Удельная теплота парообразования – физическая величина, показывающая количество теплоты, необходимое для превращения в пар 1 кг вещества (как правило, при температуре кипения). Единица удельной теплоты парообразования – 1 Дж/кг.

Количество теплоты, поглощённое кипящей (или испаряющейся при постоянной температуре) жидкостью, прямо пропорционально массе образовавшегося пара. Коэффициент пропорциональности – удельная теплота парообразования вещества.

При охлаждении/кристаллизации/конденсации выделяется точно такое же количество теплоты, которое было затрачено для нагревания/плавления/парообразования вещества (если температуры и давления при прямом и обратном процессах соответствуют друг другу).Утверждение будет верным и наоборот.

Тепловые явления




Законы термодинамика
Первый закон термодинамики устанавливает равенство между изменением внутренней энергии тела и суммой полученной телом теплоты и совершённой над ним работы.

Тепловой двигатель – периодически действующее устройство, служащее для превращения внутренней энергии рабочего тела (как правило, газа или пара) в механическую энергию.

Количество теплоты, выделяющееся при полном сгорании вещества (топлива), прямо пропорционально массе сгоревшего вещества (топлива). Коэффициент пропорциональности – удельная теплота сгорания топлива.

Известно три способа теплопередачи (теплообмена) – теплопроводность, конвекция и излучение. При теплопроводности теплота проникает через вещество без его перемещения (в случае отсутствия вещества теплопроводность является нулевой). При конвекции теплота перемещается неравномерно нагретым движущимся веществом (в условиях, когда возможно возникновение архимедовой силы). При излучении теплота передаётся через пространство или вещество в виде электромагнитных волн (для излучения наличие вещества не является обязательным, в отличие от первых двух способов теплопередачи).

Второй закон термодинамики гласит, что теплообмен самостоятельно протекает только в таком направлении, что температура менее нагретого тела возрастает, а более нагретого – уменьшается.


`
export const Elec = `
Элементарный заряд – минимальный заряд (е = 1,6∙10-19 Кл)

Заряд любого тела кратен целому числу элементарных зарядов:     q = N∙е

Электризация тел – перераспределение заряда между телами. Способы электризации: трение,  касание, влияние.

Закон сохранения электрического заряда – в замкнутой системе алгебраическая сумма зарядов всех частиц остается неизменной.  q1 + q 2 + q 3 + …..+ qn =  const

Пробный заряд – точечный положительный заряд.

Закон Кулона
Закон Кулона (установлен опытным путем в 1785 году) Сила взаимодействия двух неподвижных точечных зарядов в вакууме прямо пропорциональна произведению модулей зарядов и обратно пропорционально квадрату расстояния между ними.
`
